import 'package:hmelnaya_lavka_app/models/model.dart';

Map<String, dynamic> test_bd = {
  'item_1': {
    'id': 'item_1',
    'name': 'Продукт 1 категории пиво',
    'price': 100,
    'category': 'пиво'
  },
  'item_2': {
    'id': 'item_2',
    'name': 'Продукт 2 категории пиво',
    'price': 200,
    'category': 'пиво'
  },
  'item_3': {
    'id': 'item_3',
    'name': 'Продукт 3 категории пиво',
    'price': 300,
    'category': 'пиво'
  },
  'item_4': {
    'id': 'item_4',
    'name': 'Продукт 4 категории пиво',
    'price': 400,
    'category': 'пиво'
  },
  'item_5': {
    'id': 'item_5',
    'name': 'Продукт 5 категории пиво',
    'price': 500,
    'category': 'пиво'
  },
  'item_6': {
    'id': 'item_6',
    'name': 'Продукт 1 категории рыба горячего копчения',
    'price': 100,
    'category': 'рыба горячего копчения'
  },
  'item_7': {
    'id': 'item_7',
    'name': 'Продукт 2 категории рыба горячего копчения',
    'price': 200,
    'category': 'рыба горячего копчения'
  },
  'item_8': {
    'id': 'item_8',
    'name': 'Продукт 3 категории рыба горячего копчения',
    'price': 300,
    'category': 'рыба горячего копчения'
  },
  'item_9': {
    'id': 'item_9',
    'name': 'Продукт 4 категории рыба горячего копчения',
    'price': 400,
    'category': 'рыба горячего копчения'
  },
  'item_10': {
    'id': 'item_10',
    'name': 'Продукт 5 категории рыба горячего копчения',
    'price': 500,
    'category': 'рыба горячего копчения'
  },
  'item_11': {
    'id': 'item_11',
    'name': 'Продукт 1 категории рыба холодного копчения',
    'price': 100,
    'category': 'рыба холодного копчения'
  },
  'item_12': {
    'id': 'item_12',
    'name': 'Продукт 2 категории рыба холодного копчения',
    'price': 200,
    'category': 'рыба холодного копчения'
  },
  'item_13': {
    'id': 'item_13',
    'name': 'Продукт 3 категории рыба холодного копчения',
    'price': 300,
    'category': 'рыба холодного копчения'
  },
  'item_14': {
    'id': 'item_14',
    'name': 'Продукт 4 категории рыба холодного копчения',
    'price': 400,
    'category': 'рыба холодного копчения'
  },
  'item_15': {
    'id': 'item_15',
    'name': 'Продукт 5 категории рыба холодного копчения',
    'price': 500,
    'category': 'рыба холодного копчения'
  },
  'item_16': {
    'id': 'item_16',
    'name': 'Продукт 1 категории мясная продукция',
    'price': 100,
    'category': 'мясная продукция'
  },
  'item_17': {
    'id': 'item_17',
    'name': 'Продукт 2 категории мясная продукция',
    'price': 200,
    'category': 'мясная продукция'
  },
  'item_18': {
    'id': 'item_18',
    'name': 'Продукт 3 категории мясная продукция',
    'price': 300,
    'category': 'мясная продукция'
  },
  'item_19': {
    'id': 'item_19',
    'name': 'Продукт 4 категории мясная продукция',
    'price': 400,
    'category': 'мясная продукция'
  },
  'item_20': {
    'id': 'item_20',
    'name': 'Продукт 5 категории мясная продукция',
    'price': 500,
    'category': 'мясная продукция'
  },
  'item_21': {
    'id': 'item_21',
    'name': 'Продукт 1 категории чипсы',
    'price': 100,
    'category': 'чипсы'
  },
  'item_22': {
    'id': 'item_22',
    'name': 'Продукт 2 категории чипсы',
    'price': 200,
    'category': 'чипсы'
  },
  'item_23': {
    'id': 'item_23',
    'name': 'Продукт 3 категории чипсы',
    'price': 300,
    'category': 'чипсы'
  },
  'item_24': {
    'id': 'item_24',
    'name': 'Продукт 4 категории чипсы',
    'price': 400,
    'category': 'чипсы'
  },
  'item_25': {
    'id': 'item_25',
    'name': 'Продукт 5 категории чипсы',
    'price': 500,
    'category': 'чипсы'
  },
  'item_26': {
    'id': 'item_26',
    'name': 'Продукт 1 категории напитки безалкогольные',
    'price': 100,
    'category': 'напитки безалкогольные'
  },
  'item_27': {
    'id': 'item_27',
    'name': 'Продукт 2 категории напитки безалкогольные',
    'price': 200,
    'category': 'напитки безалкогольные'
  },
  'item_28': {
    'id': 'item_28',
    'name': 'Продукт 3 категории напитки безалкогольные',
    'price': 300,
    'category': 'напитки безалкогольные'
  },
  'item_29': {
    'id': 'item_29',
    'name': 'Продукт 4 категории напитки безалкогольные',
    'price': 400,
    'category': 'напитки безалкогольные'
  },
  'item_30': {
    'id': 'item_30',
    'name': 'Продукт 5 категории напитки безалкогольные',
    'price': 500,
    'category': 'напитки безалкогольные'
  },
  'item_31': {
    'id': 'item_31',
    'name': 'Продукт 1 категории кухня',
    'price': 100,
    'category': 'кухня'
  },
  'item_32': {
    'id': 'item_32',
    'name': 'Продукт 2 категории кухня',
    'price': 200,
    'category': 'кухня'
  },
  'item_33': {
    'id': 'item_33',
    'name': 'Продукт 3 категории кухня',
    'price': 300,
    'category': 'кухня'
  },
  'item_34': {
    'id': 'item_34',
    'name': 'Продукт 4 категории кухня',
    'price': 400,
    'category': 'кухня'
  },
  'item_35': {
    'id': 'item_35',
    'name': 'Продукт 5 категории кухня',
    'price': 500,
    'category': 'кухня'
  },
  'item_36': {
    'id': 'item_36',
    'name': 'Продукт 1 категории орехи',
    'price': 100,
    'category': 'орехи'
  },
  'item_37': {
    'id': 'item_37',
    'name': 'Продукт 2 категории орехи',
    'price': 200,
    'category': 'орехи'
  },
  'item_38': {
    'id': 'item_38',
    'name': 'Продукт 3 категории орехи',
    'price': 300,
    'category': 'орехи'
  },
  'item_39': {
    'id': 'item_39',
    'name': 'Продукт 4 категории орехи',
    'price': 400,
    'category': 'орехи'
  },
  'item_40': {
    'id': 'item_40',
    'name': 'Продукт 5 категории орехи',
    'price': 500,
    'category': 'орехи'
  },
  'item_41': {
    'id': 'item_41',
    'name': 'Продукт 1 категории морепродукты',
    'price': 100,
    'category': 'морепродукты'
  },
  'item_42': {
    'id': 'item_42',
    'name': 'Продукт 2 категории морепродукты',
    'price': 200,
    'category': 'морепродукты'
  },
  'item_43': {
    'id': 'item_43',
    'name': 'Продукт 3 категории морепродукты',
    'price': 300,
    'category': 'морепродукты'
  },
  'item_44': {
    'id': 'item_44',
    'name': 'Продукт 4 категории морепродукты',
    'price': 400,
    'category': 'морепродукты'
  },
  'item_45': {
    'id': 'item_45',
    'name': 'Продукт 5 категории морепродукты',
    'price': 500,
    'category': 'морепродукты'
  }
};

List<String> category = [
  "Пиво",
  "Г/К",
  "Х/К",
  "Мясо",
  'Снеки',
  'Б/а',
  'Кухня',
  'Орехи',
  'Креветки'
];

List<String> navigationCategory = [
  "Пиво",
  "Горячее копчение",
  "Холодное копчение",
  "Мясо",
  "Снеки",
  "Безалкогольные",
  "Кухня",
  "Орехи",
  "Креветки",
];

Map<BasketItem, int> usersBasket = {};
Map<BasketItem, String> usersBasketImage = {};
